{
	"name": "Streadata.io API Gallery - Resource Tags",
	"description": "This is a repository of resource tags APIs, self-contained as a Github repository, with HTML and YAML representations of the APIs and their surrounding operations.",
	"image": "http://template.streamdata.gallery/assets/resource-tags.png",
	"created": "2018-02-24",
	"modified": "2018-08-28",
	"url": "http://resource-tags.streamdata.gallery/apis.json",
	"specificationVersion": "0.14",
	"apis": [
		{
			"name": "AWS ElastiCache",
			"x-api-slug": "aws-elasticache",
			"description": "Amazon ElastiCache is a web service that makes it easy to deploy, operate, and scale an in-memory data store or cache in the cloud. The service improves the performance of web applications by allowing you to retrieve information from fast, managed, in-memory data stores, instead of relying entirely on slower disk-based databases. Amazon ElastiCache automatically detects and replaces failed nodes, reducing the overhead associated with self-managed infrastructures and provides a resilient system that mitigates the risk of overloaded databases, which slow website and application load times. Through integration with Amazon CloudWatch, Amazon ElastiCache provides enhanced visibility into key performance metrics associated with your Redis or Memcached nodes.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Database_AmazonElasticCache.png",
			"humanURL": "https://aws.amazon.com/elasticache/",
			"baseURL": ":///",
			"tags": "Resource Tags",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-elasticache/openapi.md"
				}
			]
		},
		{
			"name": "AWS Database Migration Service",
			"x-api-slug": "aws-database-migration-service",
			"description": "AWS Database Migration Service helps you migrate databases to AWS easily and securely. The source database remains fully operational during the migration, minimizing downtime to applications that rely on the database. The AWS Database Migration Service can migrate your data to and from most widely used commercial and open-source databases. The service supports homogenous migrations such as Oracle to Oracle, as well as heterogeneous migrations between different database platforms, such as Oracle to Amazon Aurora or Microsoft SQL Server to MySQL. It also allows you to stream data to Amazon Redshift from any of the supported sources including Amazon Aurora, PostgreSQL, MySQL, MariaDB, Oracle, SAP ASE and SQL Server, enabling consolidation and easy analysis of data in the petabyte-scale data warehouse. AWS Database Migration Service can also be used for continuous data replication with high-availability.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Database_AWSDatabaseMigrationService.png",
			"humanURL": "https://aws.amazon.com/dms/",
			"baseURL": ":///",
			"tags": "Resource Tags",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-database-migration-service/openapi.md"
				}
			]
		},
		{
			"name": "AWS Direct Connect",
			"x-api-slug": "aws-direct-connect",
			"description": "AWS Direct Connect makes it easy to establish a dedicated network connection from your premises to AWS. Using AWS Direct Connect, you can establish private connectivity between AWS and your datacenter, office, or colocation environment, which in many cases can reduce your network costs, increase bandwidth throughput, and provide a more consistent network experience than Internet-based connections.AWS Direct Connect lets you establish a dedicated network connection between your network and one of the AWS Direct Connect locations. Using industry standard 802.1q VLANs, this dedicated connection can be partitioned into multiple virtual interfaces. This allows you to use the same connection to access public resources such as objects stored in Amazon S3 using public IP address space, and private resources such as Amazon EC2 instances running within anAmazon Virtual Private Cloud (VPC)using private IP space, while maintaining network separation between the public and private environments. Virtual interfaces can be reconfigured at any time to meet your changing needs.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Networking_AWSDirectConnect.png",
			"humanURL": "https://aws.amazon.com/directconnect/",
			"baseURL": ":///",
			"tags": "Resource Tags",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-direct-connect/openapi.md"
				}
			]
		},
		{
			"name": "AWS Directory Service",
			"x-api-slug": "aws-directory-service",
			"description": "AWS Directory Service for Microsoft Active Directory (Enterprise Edition), also known as AWS Microsoft AD, enables your directory-aware workloads and AWS resources to use managed Active Directory in the AWS Cloud. The Microsoft AD service is built on actual Microsoft Active Directory and does not require you to synchronize or replicate data from your existing Active Directory to the cloud. You can use standard Active Directory administration tools and take advantage of built-in Active Directory features such as Group Policy, trusts, and single sign-on. With Microsoft AD, you can easily joinAmazon EC2andAmazon RDS for SQL Serverinstances to a domain, and useAWS Enterprise IT applicationssuch asAmazon WorkSpaceswith Active Directory users and groups.",
			"image": "http://kinlane-productions.s3.amazonaws.com/api-evangelist-site/company/logos/Security-Identity_AWSDirectoryService.png",
			"humanURL": "https://aws.amazon.com/directoryservice/",
			"baseURL": ":///",
			"tags": "Resource Tags",
			"properties": [
				{
					"type": "x-openapi-spec",
					"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-directory-service/openapi.md"
				}
			]
		}
	],
	"tags": "Resource Tags",
	"include": [
		{
			"name": "AWS ElastiCache",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-elasticache/apis.yaml"
		},
		{
			"name": "AWS Database Migration Service",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-database-migration-service/apis.yaml"
		},
		{
			"name": "AWS Direct Connect",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-direct-connect/apis.yaml"
		},
		{
			"name": "AWS Directory Service",
			"url": "https://raw.githubusercontent.com/streamdata-gallery-topics/resource-tags/master/_listings/aws-directory-service/apis.yaml"
		}
	]
}